pres.org
#+TITLE:Excercise 1 presentation 
#+AUTHOR: Maik Schünemann
#+email: maikschuenemann@gmail.com
#+TAGS:  BlowerDoor(b) Suub(s) Uni(u) Home(h) Task(t) Note(n) Info(i)#+TAGS: Changed(c) Project(p) Reading(r) Hobby(f) OpenSource(o) Meta(m)#+SEQ_TODO: TODO(t) STARTED(s) WAITING(w) APPT(a) | DONE(d) CANCELLED(c) DEFERRED(f) NEXT(n)#+STARTUP:showall
#+LaTeX_CLASS: try
#+LaTeX_CLASS: beamer
** Outline
   - Components and Processes
   - Dealing with the example problems
   - Examples
** Components and Processes
    To be able to process visual stimuli we need the following components:
    - Perceptual System
      Responsibilities:
      - Build a model of the visual stimuli suitable to further processing.
      - Build a model of the given task
    - Strategical System
      Responsibilities:
      - Models the thinking process
      - Designs a strategy of how to approach the problem
    - Processing System
      Responsibilities:
      - Executes the chosen strategy
      - Stores results in the memory system

**  Components and Processes
     - Memory System
      Responsibilities:
      - In this problem domain we only need short term memory
      - Simply provides a place to store information
    - Temporal System
      - Gives the architecture a sense of time
      - Can cancel current actions when there is no time left



** Dealing with the example problems
*** Task is described
   - Perceptual System responsible for modeling and storing the model in memory
   - Strategical System decides about the strategy
   - Temporal system sets timer
*** Picture is shown
   - Perceptual system models the system and stores model in memory
   - Processing system is invoked to execute the chosen strategy
     - Stores intermediate results in memory
   - When no time is left gets interrupted by the memory system
   - Has chance to make a guess about the final result

** Models

*** Task
    - modeled after features it has to recognize when looking at a single cell

*** Picture
    - Matrix of cells containing features of objects at the position

*** Strategy
    determines:
      - which order to process the cells of the picture
      - guess when no time is left
*** Simple strategy
    - scan top to bottom left to right 
    - return number of matching objects counted if no time is left

*** Advanced strategy
    - scan top to bottom left to right
    - interpolate guess from amount seen so far on interrupt

** Examples
   Live.....
